데이터를 합칠 때 `merge`,`concat`으로 불가능한 상황이 있는데, 두 데이터 셋의 색인이 일부 겹치거나 전체가 겹치는 경우가 그렇다.<br/>
벡터화된 if-else 구문을 표현하는 Numpy의 where함수를 통해 자세히 알아보자.

In [1]:
import numpy as np
import pandas as pd

In [4]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.NAN],
             index=['f','e','d','c','b','a'])

In [14]:
b = pd.Series(np.arange(len(a), dtype=np.float64),
             index=['f','e','d','c','b','a'])

In [15]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [16]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [22]:
np.where(pd.isnull(a),b,a)

array([0. , 2.5, 2. , 3.5, 4.5, 5. ])

Series 객체의 `combine-first`라는 메서드는 위와 동일한 연산을 제공하며 데이터 정렬 기능까지 제공한다.

In [18]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

DataFrame에서 `combine_first` 메서드는 컬럼에 대해 같은 동작을 한다.<br/>
그래서 이를 통해 호출하는 객체에서 누락된 데이터를 인자로 넘긴 객체에 있는 값으로 채울 수 있다.

In [23]:
df1 = pd.DataFrame({'a':[1., np.NAN, 5., np.NAN],
                   'b':[np.NAN, 2., np.NAN, 6.],
                   'c':range(2,18,4)})

In [24]:
df2 = pd.DataFrame({'a':[5., 4., np.NAN, 3., 7.],
                   'b':[np.NAN, 3., 4., 6.,8.]})

In [25]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [26]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [27]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN